app/controllers/books_controller.rb

  def create
    @book=Book.new(book_params)
    if @book.save
      flash[:sucess] = 'Book was successfully created.'
      redirect_to book_path(@book.id)
    else
      @books=Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "リーダブルコード"], ["body", "より良いコードを書くためのシンプルで実践的なテクニック"], ["created_at", "2021-10-11 12:15:51.757617"], ["updated_at", "2021-10-11 12:15:51.757617"]]
SELECT "books".* FROM "books"